/* Създава фабрика за лютеница с име „Хорце Ентърпрайз“.
- Фабриката има следните характеристики:
• Наименование;
• Адрес;
• Капитал
• Списък със берачки, които берат домати и чушки.
• Нива с продукти /чушки и домати/
- Берачките имат следните характеристики:
• Име;
• Профил /чушки, домати/
• Скорост на бране в бройки.
• портфейл
- Нивата има следните характеристики:
• Количества чушки, домати в брой
• Обща площ
- Всяки продукт има следните характеристики:
• вид
• цена
• грамаж /от 100 до 500гр/ 
Фабриката има 300 чушки и 400 домата, като при създаването си нивата и е заредена
на макс.
2. Генерира 25 берачки, като на произволен принцип трябва да бъдат имигранти, селяни или
програмистки. Вероятността да се създаде имигрант е 20%, програмист – 30% , а селянин –
50%. Всяка берачка може да има скорост от 10 до 100 продукта на час генерирани на
случаен принцип и един от двата профила.
- Направете програма, която стартира работата на фабриката. Работата на фабриката се състои в
генериране на следното: нива с продукти и берачки; Берачките обират цялата нива. В касата влиза цената на обраните продукти с 25% надценка. Всяка берачка е заработила 25% от стойността на набраните продукти. 
 
1. Да се изведе текущият паричен баланс на фабриката.
2. Да се изведат характеристиките на най-бавната и най-бърза берачка .
3. Да се изведат имената, вида, профила и заработеното на всички берачки, с възможност за
сортиране и групиране по вид на берачката, профил, заработено и име.
4. Да се изведе коя група берачки са работили най-добре по брой продукти.
5. Да се изведе колко буркана/400гр. / лютеница е станала.

 */
#include <stdio.h> 
#include <stdlib.h> 
#include <string.h> 
#include "Pick2.h"

  int main(){
      picker *head=NULL;
      picker *tmp;
      for(int i=0;i<25;i++){
          tmp=create_new_picker('P','P',2.2,3.2,10);
          tmp->next=head;
          head=tmp;
          printf("\n");
      }
      /* printlist(head); */
      factory f1;
      field lulin;
      f1.a=head;
        /* printlist(f1.a); */
        generate_work_factory(&f1,tmp,lulin,f1.capital);
        /* printf("%f",f1.capital); */
        printlist(f1.a);
        printf("The fastest picker with velocity:%d\n",fastestPicker(f1.a));
        printf("The slowest picker with velocity:%d\n",slowestPicker(f1.a));
        printf("The sum of all products in weight:%f\n",generate_jars(f1.a));
        printf("The sum of produces jars:%g\n",generate_jars(f1.a)/forjar);
        printf("The fastest programmer with velocity:%d\n",fastestProgrammer(f1.a));
        printf("The slowest imigrant with velocity:%d\n",slowestImigrant(f1.a));

    return 0;
  }
